console.log("Завдання: 7 ==============================");

// Створюємо функцію task7, яка використовує setInterval та проміси.
function task7() {
    // Створюємо новий проміс.
    // Використовуємо функцію setInterval, щоб виконати функцію кожну секунду.
    // Отримаємо поточну дату та час
    // Отримуємо секунди з поточної дати
    // Виводимо в консоль повідомлення `Поточні секунди: ${seconds}`
    // Якщо поточні секунди кратні 10, очищуємо інтервал та резолвимо проміс з рядком "Поточні секунди кратні 10!".
    // Якщо поточні секунди кратні 3, очищуємо інтервал та відхиляємо проміс з рядком "Поточні секунди кратні 3!".
    // Використовуємо then для обробки зарезолвленого проміса, та виводимо в консоль `Проміс зарезолвився з значенням: ${value}` .
    // Якщо проміс відхилено, обробляємо помилку за допомогою catch, та виводимо в консоль `Проміс відхилився з помилкою: ${error}`.
    // Використовуємо finally для виконання дій після завершення проміса, незалежно від його статусу, та виводимо в консоль "Проміс завершено".
    const promise = new Promise((resolve, reject) => {
        let seconds = 0;

        const intervalId = setInterval(() => {
            seconds++;
            console.log(`Поточні секунди: ${seconds}`);

            if (seconds % 10 === 0) {
                clearInterval(intervalId);
                resolve("Поточні секунди кратні 10!");
            } else if (seconds % 3 === 0) {
                clearInterval(intervalId);
                reject("Поточні секунди кратні 3!");
            }
        }, 1000);
    });

    promise
        .then((value) => {
            console.log(`Проміс зарезолвився з значенням: ${value}`);
        })
        .catch((error) => {
            console.log(`Проміс відхилився з помилкою: ${error}`);
        })
        .finally(() => {
            console.log("Проміс завершено");
        });
}

// Викликаємо функцію task7
task7();

// Поточні секунди: 1
// Поточні секунди: 2
// Поточні секунди: 3
// Проміс відхилився з помилкою: Поточні секунди кратні 3!
// Проміс завершено
